In [2]:
import pandas as pd
data = {"Name":["Alice","Bob","Alice","David"],
       "Age":[25,30,25,40],
       "City":["NY","LA","NY","Chicago"]}
df = pd.DataFrame(data)
display(df)

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
2  Alice   25       NY
3  David   40  Chicago

In [6]:
#Removing duplicates
unique_df = df.drop_duplicates()
display(unique_df)

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago

In [12]:
result = df.drop_duplicates(subset=['Name'])
result

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago

In [15]:
#KEEP THE LAST OCCURRENCE OF DULIcates
result = df.drop_duplicates(keep='last')
print(result)

    Name  Age     City
1    Bob   30       LA
2  Alice   25       NY
3  David   40  Chicago

In [17]:
result = df.drop_duplicates(keep='first')
print(result)

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago

In [19]:
result = df.drop_duplicates(subset=['Name'],keep='first')
result

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago

In [8]:
#drope duplicates based on the 'Name' column
result = df.drop_duplicates(subset=['Name'],keep='last') #inplae = true or false
result

    Name  Age     City
1    Bob   30       LA
2  Alice   25       NY
3  David   40  Chicago

In [23]:
result = df.drop_duplicates(keep=False) #inplae = true or false
result

    Name  Age     City
1    Bob   30       LA
3  David   40  Chicago

In [27]:
df.drop_duplicates(inplace=True)  #if inplace = True we dont't have create the other variable to store it it automatically stored in the main dataframe
print(df)

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago

In [39]:

x=df.drop_duplicates(inplace=False)
print(df)

    Name  Age     City
0  Alice   25       NY
1    Bob   30       LA
3  David   40  Chicago